Examinator/src/Catalogs/ВопросыСУЗ/ВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаРезультата</name>
    <type>
      <types>EnumRef.МетодыРасчетаРезультатаВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВарианты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВопроса</name>
    <type>
      <types>EnumRef.ТипыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасетныйВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Имя макета, которое задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементActiveX</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенРазвернутыйОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьИменаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеГрупп</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКатегорий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВариантовОтветов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафЗаПодсказку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальноеРазмещениеВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображениеВариантов</name>
    <type>
      <types>EnumRef.ОтображениеВариантовВопросаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйВыводВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>CatalogRef.ШаблоныТекстаСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммныйПродукт</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикреплятьКомментарииКВариантамОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭтапыРаботыВПрограмме</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ВариантыРаботыСПрограммойСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполняетсяПрограммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выделить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.РесурсыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/РубрикиОбъектовСУЗ/РубрикиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РубрикиОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рубрикатор</name>
    <type>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементРубрикатора</name>
    <type>
      <types>CatalogRef.ЭлементыРубрикатораСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПлеерКурсовВебКабинетаСУЗ/ПлеерКурсовВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлеерКурсовВебКабинетаСУЗ</name>
  <resources>
    <name>Плеер</name>
    <type>
      <types>EnumRef.ПлеерыКурсовВебКабинетаСУЗ</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыВопросовСУЗ/ТипыВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВопросовСУЗ</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ПоШаблону</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
  <enumValues>
    <name>ЭлементActiveX</name>
  </enumValues>
  <enumValues>
    <name>Открытый</name>
  </enumValues>
  <enumValues>
    <name>РаботаВПрограмме</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихПсихологический</name>
  </enumValues>
  <enumValues>
    <name>МногиеИзМногихПсихологический</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВариантыОтветовНаВопросСУЗ/ВариантыОтветовНаВопросСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыОтветовНаВопросСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВернаяГруппаФасетов</name>
    <type>
      <types>CatalogRef.ФасетыВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Верный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоступныхВариантов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииВариантовОтветовНаВопросСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредлагатьВыборВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляВерногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсДляОшибочногоКомментария</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>БаллПриПсихологическомТестировании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ВопросыСУЗ/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ТипОбъектаНаКлиенте; // Тип объекта метаданных в виде строки

&НаСервере
Перем ТипОбъектаНаСервере; // Тип объекта метаданных в виде строки

#КонецОбласти


#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем переменные
	
	Подборка           = Параметры.Подборка;
	ЭлементПодборки    = Параметры.ЭлементПодборки;
	ЭлементРубрикатора = Параметры.ЭлементРубрикатора;
	ПоставщикРубрики   = Параметры.ПоставщикРубрики;
	ЭлектронныйРесурс  = Параметры.ЭлектронныйРесурс;
	
	Если ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		ТипЭлектронногоРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Тип");
	КонецЕсли;
	
	РазработкаСУЗ.УстановитьРодителяНовогоОбъекта(Объект, Параметры, "СправочникСсылка.ВопросыСУЗ");
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(Объект);
	
	Если Объект.Ссылка.Пустая() Тогда
		// Если объект уже записан, то процедура
		// Будет вызвана при загрузки версии.
		ЗагрузитьВерсиюНаСервере(Истина);
	КонецЕсли;

	ВесВопроса = 1;
	
	Если ЗначениеЗаполнено(Параметры.ЭлементПодборки) Тогда
		ВесВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЭлементПодборки, "ВесВопроса");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЭлементРубрикатора) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РубрикиОбъектовСУЗ.ВесВопроса КАК ВесВопроса
			|ИЗ
			|	РегистрСведений.РубрикиОбъектовСУЗ КАК РубрикиОбъектовСУЗ
			|ГДЕ
			|	РубрикиОбъектовСУЗ.Рубрикатор = &Рубрикатор
			|	И РубрикиОбъектовСУЗ.ЭлементРубрикатора = &ЭлементРубрикатора
			|	И РубрикиОбъектовСУЗ.Поставщик = &Поставщик
			|	И РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ";

		Запрос.УстановитьПараметр("Поставщик", Параметры.ПоставщикРубрики);
		Запрос.УстановитьПараметр("Рубрикатор", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЭлементРубрикатора, "Владелец"));
		Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", Объект.Ссылка);
		Запрос.УстановитьПараметр("ЭлементРубрикатора", Параметры.ЭлементРубрикатора);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВесВопроса = ВыборкаДетальныеЗаписи.ВесВопроса;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек <> Неопределено Тогда
		ПоказатьДополнительныеТипыВопросов = ДанныеНастроек.Получить("ПоказатьДополнительныеТипыВопросов");
	КонецЕсли;
	
	ДоступныеТипы = Новый Массив();
	ДоступныеТипы.Добавить(Тип("СправочникСсылка.РесурсыСУЗ"));
	
	Элементы.ЭлементActiveX.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
	
	Элементы.ВариантыОтветов.ДополнительныеПараметрыСоздания = Новый ФиксированнаяСтруктура(Новый Структура("Подборка", Подборка));
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьТаблицуСвязанныхЭлементов();
	КонецЕсли;
	
	// Устанавливаем доступность элементов
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗагрузитьВерсиюНаСервере(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);

	ЗаполнитьТаблицуСвязанныхЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И (Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногих")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногих"))
		И НЕ ЕстьВерныйВариант(Объект.Ссылка) Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПродолжение", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Отсутствуют верные варианты ответов. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПродолжение(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтоЗакрытие = Истина;
	    Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РазработкаСУЗКлиент.ИмяРедактируемыхДанныхПриЗаписи(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ИспользуетсяФорматированныйДокумент Тогда
		
		Если ТипЗнч(Вопрос) <> Тип("ФорматированныйДокумент")  Тогда
			Вопрос = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("ФорматированныйДокумент")  Тогда
			Ответ = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		Если ТипЗнч(Подсказка) <> Тип("ФорматированныйДокумент")  Тогда
			Подсказка = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		Если ТипЗнч(Описание) <> Тип("ФорматированныйДокумент")  Тогда
			Описание = Новый ФорматированныйДокумент;
		КонецЕсли;
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Вопрос, "Вопрос", "ФорматированныйДокумент");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Ответ, "Ответ", "ФорматированныйДокумент");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Подсказка, "Подсказка", "ФорматированныйДокумент");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, Описание, "Описание", "ФорматированныйДокумент");
		
	Иначе
		
		Если ТипЗнч(Вопрос) = Тип("ТекстовыйДокумент")  Тогда
			ВопросДляСохранения = Вопрос.ПолучитьТекст();
		Иначе
			ВопросДляСохранения = Вопрос;
		КонецЕсли;
		
		Если ТипЗнч(Ответ) = Тип("ТекстовыйДокумент")  Тогда
			ОтветДляСохранения = Ответ.ПолучитьТекст();
		Иначе
			ОтветДляСохранения = Ответ;
		КонецЕсли;
		
		Если ТипЗнч(Подсказка) = Тип("ТекстовыйДокумент")  Тогда
			ПодсказкаДляСохранения = Подсказка.ПолучитьТекст();
		Иначе
			ПодсказкаДляСохранения = Подсказка;
		КонецЕсли;
		
		Если ТипЗнч(Описание) = Тип("ТекстовыйДокумент")  Тогда
			ОписаниеДляСохранения = Описание.ПолучитьТекст();
		Иначе
			ОписаниеДляСохранения = Описание;
		КонецЕсли;
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ВопросДляСохранения, "Вопрос", "ТекстовыеДанные");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ОтветДляСохранения, "Ответ", "ТекстовыеДанные");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ПодсказкаДляСохранения, "Подсказка", "ТекстовыеДанные");
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, ОписаниеДляСохранения, "Описание", "ТекстовыеДанные");
		
	КонецЕсли;
	
	// Сохраняем варианты ответов.
	
	// Примечание: варианты еще сохраняются в форме элемента справочника ВариантыОтветовНаВопросСУЗ после записи
	// Варианта, для версии, которая была последняя сохранена на момент записи варианта.
	
	Для каждого Строка Из ДанныеВариантовОтветов Цикл
		
		СтруктураДанныхВариантов = Новый Структура;
		СтруктураДанныхВариантов.Вставить("ТекстовыеДанные", Строка.Текст);
		СтруктураДанныхВариантов.Вставить("ВерныйКомментарий", Строка.ВерныйКомментарий);
		СтруктураДанныхВариантов.Вставить("ОшибочныйКомментарий", Строка.ОшибочныйКомментарий);
		
		РазработкаСУЗ.ЗаписатьДанныеВерсииОбъектаСУЗ(ТекущийОбъект, СтруктураДанныхВариантов, Строка.ВариантОтвета, "ВсеРеквизиты");	
	
	КонецЦикла;
	
	// Обновляем другие элементы
	
	Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
		Справочники.ЭлементыПодборкиСУЗ.Перезаписать(ЭлементПодборки, ВесВопроса);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементРубрикатора) Тогда
		РегистрыСведений.РубрикиОбъектовСУЗ.Перезаписать(ЭлементРубрикатора, ПоставщикРубрики, Объект.Ссылка, ВесВопроса);
	КонецЕсли;	
	
	ЗаписатьТаблицуСвязанныхЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РазработкаСУЗ.ПоказатьКоличествоВерсийОбъектаНаФорме(ЭтотОбъект, ТекущийОбъект);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РазработкаСУЗКлиент.УстановитьДоступностьЭлементовВерсииДанных(ЭтотОбъект);

	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("ВопросЗаписан",,ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Подборка) Тогда
		Оповестить("ПодборкаОбновлена", Подборка, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФасетныйВопросПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипВопросаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементActiveXОткрытие(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, Объект.ЭлементActiveX);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементActiveXСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементActiveXОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительныеТипыВопросовПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура КомментарииРесурсСоздание(Элемент, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаСозданияРесурса(ЭтотОбъект, Элемент, СтандартнаяОбработка, Подборка);
КонецПроцедуры

&НаКлиенте
Процедура КомментарииРесурсОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Комментарии.ТекущиеДанные;
	
	Если НЕ ОбщегоНазначенияСУКлиент.ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	РазработкаСУЗКлиент.ОбработкаОткрытияРесурса(Элемент, СтандартнаяОбработка, ТекущиеДанные.Ресурс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарииРесурсОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РазработкаСУЗКлиент.ОбработкаВыбораРесурса(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВариантыОтветов

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВариантыОтветов

&НаКлиенте
Процедура ВариантыОтветовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКатегорииОтветов

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ КатегорииОтветов

&НаКлиенте
Процедура КатегорииОтветовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФасеты

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Фасеты

&НаКлиенте
Процедура ФасетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСсылки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Ссылки

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура АрхивВерсий(Команда)
	РазработкаСУЗКлиент.ОткрытьВерсииОбъекта(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВерсию(Команда)
	СтруктураНовойВерсии = РазработкаСУЗ.ПолучитьСтруктуруНовойВерсииОбъекта(Объект, ТипОбъектаНаКлиенте);
	РазработкаСУЗКлиент.СоздатьВерсиюОбъекта(ЭтотОбъект, СтруктураНовойВерсии);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВариантВверх(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вверх", Элементы.ВариантыОтветов);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВариантВниз(Команда)
	РазработкаСУЗКлиент.ПереместитьЭлемент("Вниз", Элементы.ВариантыОтветов);
КонецПроцедуры

&НаКлиенте
Процедура ИмяРедактируемыхДанныхПриИзменении(Элемент)
	
	РазработкаСУЗКлиент.ИмяРедактируемыхДанныхПриИзменении(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Общее

&НаСервереБезКонтекста
Функция ЕстьВерныйВариант(СсылкаНаВопрос)
	Возврат Справочники.ВопросыСУЗ.ЕстьВерныйВариант(СсылкаНаВопрос);
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыПриЗагрузке()
	
	//////////////////////////////////////////////////////////////////
	
	// Устанавливаем доступность данных от поставщика
	
	ТаблицаДоступностиДанныхПоставщика = РазработкаСУЗ.ПолучитьТаблицуДоступностиДанныхПоставщика();

	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ТекстовыйДокумент;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ГруппаФорматированныйДокумент;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.ВариантыОтветов;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.КатегорииОтветов;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Фасеты;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	Строка = ТаблицаДоступностиДанныхПоставщика.Добавить();
	Строка.ЭлементФормы = Элементы.Ссылки;
	Строка.Свойство = "ТолькоПросмотр";
	Строка.Значение = Ложь;
	
	РазработкаСУЗ.УстановитьДоступностьДанныхОтПоставщика(ЭтотОбъект, ТаблицаДоступностиДанныхПоставщика);
	
	//////////////////////////////////////////////////////////////////
	
	РазработкаСУЗ.УстановитьДоступностьРедактора(ЭтотОбъект);
	        
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	// Вкладка "Фасеты"
	
	Если Объект.ФасетныйВопрос Тогда
		Элементы.СтраницаФасеты.Видимость = Истина;
	Иначе
		Элементы.СтраницаФасеты.Видимость = Ложь;
	КонецЕсли;
	
	// Вкладка "Варианты ответов"
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Открытый")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.РаботаВПрограмме") Тогда
		Элементы.СтраницаВариантыОтветов.Видимость = Ложь;
	Иначе
		Элементы.СтраницаВариантыОтветов.Видимость = Истина;
	КонецЕсли;
	
	// Вкладка "Категории"
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.СтраницаКатегорииОтветов.Видимость = Истина;
		Элементы.ВариантыОтветовКатегория.Видимость = Истина;
	Иначе
		Элементы.СтраницаКатегорииОтветов.Видимость = Ложь;
		Элементы.ВариантыОтветовКатегория.Видимость = Ложь;
	КонецЕсли;

	// Конфигурация
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.РаботаВПрограмме") Тогда
	
		Элементы.ПрограммныйПродукт.Видимость = Истина;
		Элементы.СтраницаЭтапыРаботыВПрограмме.Видимость = Истина;
		Элементы.СтраницаПараметры.Видимость = Истина;
		Элементы.СтраницаКомментарии.Видимость = Истина;
		
	Иначе
		
		Элементы.ПрограммныйПродукт.Видимость = Ложь;
		Элементы.СтраницаЭтапыРаботыВПрограмме.Видимость = Ложь;
		Элементы.СтраницаПараметры.Видимость = Ложь;
		Элементы.СтраницаКомментарии.Видимость = Ложь;
		
	КонецЕсли;
		
	// Метод расчета результата
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногих")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Последовательность")
		ИЛИ	Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Соответствие")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.МетодРасчетаРезультата.Доступность = Истина;
	Иначе
		Элементы.МетодРасчетаРезультата.Доступность = Ложь;
	КонецЕсли;
	
	// Флажок "Фасетный вопрос"
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногих")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногих")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.ФасетныйВопрос.Доступность = Истина;
	Иначе
		Элементы.ФасетныйВопрос.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Открытый") Тогда	
		Элементы.РазрешенРазвернутыйОтвет.Доступность = Ложь;
	Иначе
		Элементы.РазрешенРазвернутыйОтвет.Доступность = Истина;
	КонецЕсли;
	
	// Реквизит "ПеремешиватьВарианты"
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Открытый")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.РаботаВПрограмме") Тогда
		Элементы.ПеремешиватьВарианты.Доступность = Ложь;
	Иначе
		Элементы.ПеремешиватьВарианты.Доступность = Истина;
	КонецЕсли;
	
	// Последовательный вывод результата	
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Соответствие")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.ПоследовательныйВыводВариантов.Доступность = Истина;
	Иначе
		Элементы.ПоследовательныйВыводВариантов.Доступность = Ложь;
	КонецЕсли;
	
	// Отображать наименование
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX") Тогда
		Элементы.ОтображатьНаименование.Доступность = Ложь;
	Иначе
		Элементы.ОтображатьНаименование.Доступность = Истина;
	КонецЕсли;
	
	// Отображать имена полей
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX") Тогда
		Элементы.ОтображатьИменаПолей.Доступность = Ложь;
	Иначе
		Элементы.ОтображатьИменаПолей.Доступность = Истина;
	КонецЕсли;
	
	// Штраф за подсказку
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		
		Элементы.ШтрафЗаПодсказку.Доступность = Ложь;
		
	Иначе
		
		Элементы.ШтрафЗаПодсказку.Доступность = Истина;
		
	КонецЕсли;
	
	// Представление полей

	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Соответствие")
	 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.ПредставлениеГрупп.Доступность = Истина;
	Иначе
		Элементы.ПредставлениеГрупп.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Таблица") Тогда
		Элементы.ПредставлениеКатегорий.Доступность = Истина;
	Иначе
		Элементы.ПредставлениеКатегорий.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Открытый")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.РаботаВПрограмме") Тогда
		Элементы.ПредставлениеВариантовОтветов.Доступность = Ложь;
	Иначе
		Элементы.ПредставлениеВариантовОтветов.Доступность = Истина;
	КонецЕсли;
	
	// ГоризонтальноеРазмещениеВариантов и отображение вариантов
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ЭлементActiveX")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.РаботаВПрограмме")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.Открытый") 
		 ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ПоШаблону") Тогда
		Элементы.ГоризонтальноеРазмещениеВариантов.Доступность = Ложь;
		Элементы.ОтображениеВариантовГруппа.Доступность = Ложь;
	Иначе
		Элементы.ГоризонтальноеРазмещениеВариантов.Доступность = Истина;
		Элементы.ОтображениеВариантовГруппа.Доступность = Истина;
	КонецЕсли;
	
	// Разрешен развернутый ответ
	
	Если Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.ОдинИзМногихПсихологический")
		ИЛИ Объект.ТипВопроса = ПредопределенноеЗначение("Перечисление.ТипыВопросовСУЗ.МногиеИзМногихПсихологический") Тогда
		Элементы.РазрешенРазвернутыйОтвет.Доступность = Ложь;
		Объект.РазрешенРазвернутыйОтвет = Ложь;
	Иначе
		Элементы.РазрешенРазвернутыйОтвет.Доступность = Истина;
	КонецЕсли;
	
	// Тип вопроса
	
	МассивТиповВопросов = Новый Массив();
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	Если НЕ ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО")
		ИЛИ НЕ ПоказатьДополнительныеТипыВопросов Тогда			
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ЭлементActiveX);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ОдинИзМногихПсихологический);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.МногиеИзМногихПсихологический);		
	КонецЕсли;
	//----------------------------------//
	
	Если НЕ ПоказатьДополнительныеТипыВопросов Тогда								
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ПоШаблону);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Таблица);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Соответствие);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Открытый);		
	КонецЕсли;
	
	Если РегистрыСведений.ПлеерКурсовВебКабинетаСУЗ.ИспользоватьВстроенныйПлеер(ЭлектронныйРесурс) Тогда
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ПоШаблону);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Таблица);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Соответствие);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.Открытый);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ЭлементActiveX);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.РаботаВПрограмме);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.ОдинИзМногихПсихологический);
		МассивТиповВопросов.Добавить(Перечисления.ТипыВопросовСУЗ.МногиеИзМногихПсихологический);
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив();
	
	Если МассивТиповВопросов.Количество() > 0 Тогда
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ИсключитьЗначения", Новый ФиксированныйМассив(МассивТиповВопросов)));
	КонецЕсли;
	
	Элементы.ТипВопроса.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	// Вес вопроса
	
	Если ЗначениеЗаполнено(Подборка) ИЛИ ЗначениеЗаполнено(ЭлементРубрикатора) Тогда
		Элементы.ВесВопроса.Видимость = Истина;
	Иначе
		Элементы.ВесВопроса.Видимость = Ложь;
	КонецЕсли;
	
	// Связанные элементы
	
	Элементы.СтраницаСвязанныеЭлементы.Видимость = ЗначениеЗаполнено(ЭлектронныйРесурс) 
		И ТипЭлектронногоРесурса = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс;
	
	// Для веб-кабинета
	
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета = Новый Массив;
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ВесВопроса);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтраницаВид);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.ПоказатьДополнительныеТипыВопросов);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтраницаНастройки);
	МассивЭлементовНеподдерживаемыхПлееромВебКабинета.Добавить(Элементы.СтраницаСвязанныеЭлементы);
	
	РазработкаСУЗ.УбратьВидимостьНеподдерживаемыхПлееромВебКабинетаЭлементов(ЭлектронныйРесурс, МассивЭлементовНеподдерживаемыхПлееромВебКабинета);
	
	// Отборы
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(КатегорииОтветов, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Фасеты, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ВариантыОтветов, Объект.Ссылка);
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Ссылки, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВерсиюНаСервере(ПерваяЗагрузка = Ложь)
	
	// Загружаем текст вопроса (задание)
	
	ИмяРедактируемыхДанных = "Вопрос";
	РазработкаСУЗ.УстановитьДанныеВерсииОбъекта(ЭтотОбъект, Объект, ТипОбъектаНаСервере, ПерваяЗагрузка);
	
	// Загружаем таблицу с данными вариантов ответов
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ВариантыОтветовНаВопросСУЗ.Ссылка
		|ИЗ
		|	Справочник.ВариантыОтветовНаВопросСУЗ КАК ВариантыОтветовНаВопросСУЗ
		|ГДЕ
		|	ВариантыОтветовНаВопросСУЗ.Владелец = &Владелец";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка); 
		
		ВыборкаВариантыОтветов = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаВариантыОтветов.Следующий() Цикл
			
			МассивПолучаемыхРеквизитов = Новый Массив();
			МассивПолучаемыхРеквизитов.Добавить("ТекстовыеДанные");
			МассивПолучаемыхРеквизитов.Добавить("ВерныйКомментарий");
			МассивПолучаемыхРеквизитов.Добавить("ОшибочныйКомментарий");
			
			ДанныеВарианта = ОбъектыСУЗ.ПолучитьДанные(Объект.Ссылка, ВыборкаВариантыОтветов.Ссылка, Ложь, МассивПолучаемыхРеквизитов);
			
			НоваяСтрока = ДанныеВариантовОтветов.Добавить();
			НоваяСтрока.ВариантОтвета = ВыборкаВариантыОтветов.Ссылка;
			НоваяСтрока.Текст = ДанныеВарианта.ТекстовыеДанные;
			НоваяСтрока.ВерныйКомментарий = ДанныеВарианта.ВерныйКомментарий;
			НоваяСтрока.ОшибочныйКомментарий = ДанныеВарианта.ОшибочныйКомментарий;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВывестиТекстыВариантов();
	
	УстановитьДоступностьЭлементовФормыПриЗагрузке();
	
КонецПроцедуры

// Загружает данные текущей версии объекта для редактирования.
// Вызывается из общей формы "ВерсииОбъектаСУЗ" и после инициализации редактора.
//
&НаКлиенте
Процедура ЗагрузитьВерсию() Экспорт
	
	ЗагрузитьВерсиюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТекстыВариантов() Экспорт
	
	ВариантыОтветов.УсловноеОформление.Элементы.Очистить();
	
	Для каждого Строка Из ДанныеВариантовОтветов Цикл
		
		НовоеОформление = ВариантыОтветов.УсловноеОформление.Элементы.Добавить();
		НовоеОформление.Использование = Истина;
		НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
		НовоеОформление.ПредставлениеПользовательскойНастройки = "Служебное"; 
		
		Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.Использование    = Истина;
		Отбор.Представление    = "Ссылка";
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		Отбор.ПравоеЗначение   = Строка.ВариантОтвета;
		
		// Находим элемент оформления "Текст"
		ЭлементОформленияТекст = Неопределено;
		Для каждого ЭлементОформления Из НовоеОформление.Оформление.Элементы Цикл
		
			Если ЭлементОформления.Параметр = Новый ПараметрКомпоновкиДанных("Текст") Тогда
				ЭлементОформленияТекст = ЭлементОформления;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		ЭлементОформленияТекст.Значение = Строка.Текст;
		ЭлементОформленияТекст.Использование = Истина;
		
		// Устанавливаем поле для оформления
		
		ПолеОформления = НовоеОформление.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Текст"); 
		
	КонецЦикла;
	
КонецПроцедуры

// Связанные элементы

&НаСервере
Функция ПолучитьАвтоРубрикатор(СоздаватьПриОтсутствии)
	
	УникальныйИдентификаторЭР = ЭлектронныйРесурс.УникальныйИдентификатор();
	АвтоРубрикатор = Справочники.РубрикаторыСУЗ.ПолучитьСсылку(УникальныйИдентификаторЭР);
	НаименованиеЭлектронногоРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
	
	Если СоздаватьПриОтсутствии Тогда
	
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда
			АвтоРубрикаторОбъект = АвтоРубрикатор.ПолучитьОбъект();		
		Иначе
			АвтоРубрикаторОбъект = Справочники.РубрикаторыСУЗ.СоздатьЭлемент();
			АвтоРубрикаторОбъект.УстановитьСсылкуНового(АвтоРубрикатор);		
			РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(АвтоРубрикаторОбъект);
		КонецЕсли;
		
		АвтоРубрикаторОбъект.Наименование = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (заполняется автоматически)'"), НаименованиеЭлектронногоРесурса);
			
		АвтоРубрикаторОбъект.Записать();
		
		Возврат АвтоРубрикатор;	
		
	Иначе
		
		Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(АвтоРубрикатор, Ложь) Тогда
			Возврат АвтоРубрикатор;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСвязанныхЭлементов()
	
	// Очищаем таблицу
	
	СвязанныеЭлементы.Очистить();
	
	// Делаем проверки
	
	УстановитьДоступностьЭлементовФормы();
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем все элементы рубрикатора данного вопроса и заполняем таблицу
	
	АвтоРубрикатор = ПолучитьАвтоРубрикатор(Ложь);
	
	Если НЕ ЗначениеЗаполнено(АвтоРубрикатор) Тогда
		Возврат;
	КонецЕсли;
	
	РубрикиВопроса = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, Объект.Ссылка);
	
	Для каждого ТекущийЭлементРубрикатора Из РубрикиВопроса Цикл
		АвтоЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(ТекущийЭлементРубрикатора.УникальныйИдентификатор());
		НоваяСтрока = СвязанныеЭлементы.Добавить();
		НоваяСтрока.ЭлементСодержания = АвтоЭлементСодержания;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТаблицуСвязанныхЭлементов()
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат;
	КонецЕсли;
	
	АвтоРубрикатор = ПолучитьАвтоРубрикатор(Ложь);
	
	Если НЕ ЗначениеЗаполнено(АвтоРубрикатор)
		И СвязанныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Получаем авторубрикатор электронного ресурса
		
		АвтоРубрикатор = ПолучитьАвтоРубрикатор(Истина);
		
		// Получаем элементы рубрикатора для каждого элемента содержания
		
		ЭлементыРубрикатора = Новый Массив;
		
		Для каждого Строка Из СвязанныеЭлементы Цикл
		
			ТекущийЭлементРубрикатора = Справочники.ЭлементыРубрикатораСУЗ.ПолучитьСсылку(Строка.ЭлементСодержания.УникальныйИдентификатор());
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ТекущийЭлементРубрикатора, Ложь) Тогда
				ЭлементРубрикатораОбъект = ТекущийЭлементРубрикатора.ПолучитьОбъект();
			Иначе			
				ЭлементРубрикатораОбъект = Справочники.ЭлементыРубрикатораСУЗ.СоздатьЭлемент();
				ЭлементРубрикатораОбъект.УстановитьСсылкуНового(ТекущийЭлементРубрикатора);
				ЭлементРубрикатораОбъект.Владелец = АвтоРубрикатор;				
				РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементРубрикатораОбъект);
			КонецЕсли;
			
			ЭлементРубрикатораОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ЭлементСодержания, "Наименование");		
			ЭлементРубрикатораОбъект.Записать();
			
			Если ЭлементыРубрикатора.Найти(ТекущийЭлементРубрикатора) = Неопределено Тогда
				ЭлементыРубрикатора.Добавить(ТекущийЭлементРубрикатора);
			КонецЕсли;
		
		КонецЦикла;
		
		// Удаляем вопрос из элементов рубрикатора, которых нет в таблице
		
		РубрикиВопроса = РегистрыСведений.РубрикиОбъектовСУЗ.РубрикиЭлемента(АвтоРубрикатор, Объект.Ссылка);
		
		Для каждого ТекущийЭлементРубрикатора Из РубрикиВопроса Цикл
		    Если ЭлементыРубрикатора.Найти(ТекущийЭлементРубрикатора) = Неопределено Тогда
				РегистрыСведений.РубрикиОбъектовСУЗ.УдалитьЭлемент(АвтоРубрикатор, ТекущийЭлементРубрикатора, Объект.Ссылка); 
			КонецЕсли;
		КонецЦикла;
		
		// Добавляем вопрос в элементы рубрикатора, которые есть в таблице		
		
		Для каждого ТекущийЭлементРубрикатора Из ЭлементыРубрикатора Цикл		
			РегистрыСведений.РубрикиОбъектовСУЗ.ДобавитьЭлемент(АвтоРубрикатор, ТекущийЭлементРубрикатора, Объект.Ссылка); 		
		КонецЦикла;
		
		// Завершаем
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры



#КонецОбласти

#Область Инициализация

ТипОбъектаНаКлиенте = "СправочникОбъект.ВопросыСУЗ"; 
ТипОбъектаНаСервере = "СправочникОбъект.ВопросыСУЗ";

#КонецОбласти
